namespace OOP04
{
    internal class Program
    {
        static void Main(string[] args)
        {
            #region Q1  Abstraction
            //هو مفهوم في الـ OOP يركز على إخفاء التفاصيل البرمجية الداخلية المعقدة للخدمة أو الكائن وإظهار الوظائف والميزات الأساسية والضرورية فقط للمستخدم.

            //لأنه يقلل من تعقيد النظام (Reduces Complexity)، ويسمح بالتوسع المستقبلي بسهولة عبر إجبار الكلاسات الابنة على إتباع "عقد" (Contract) أو هيكل محدد دون الانشغال بكيفية تنفيذ باقي أجزاء البرنامج.
            #endregion
        }
    }
}
