namespace OOP04
{
    internal class Program
    {
        static void Main(string[] args)
        {
            #region Q1  Abstraction
            //هو مفهوم في الـ OOP يركز على إخفاء التفاصيل البرمجية الداخلية المعقدة للخدمة أو الكائن وإظهار الوظائف والميزات الأساسية والضرورية فقط للمستخدم.

            //لأنه يقلل من تعقيد النظام (Reduces Complexity)، ويسمح بالتوسع المستقبلي بسهولة عبر إجبار الكلاسات الابنة على إتباع "عقد" (Contract) أو هيكل محدد دون الانشغال بكيفية تنفيذ باقي أجزاء البرنامج.
            #endregion

            #region Q2: Abstract Classes vs. Interfaces
            //Abstract Class : يمكن أن يحتوي على متغيرات (Fields)، ودوال مكتوبة بالتفصيل
            //(Concrete methods)، ودوال مجردة (Abstract methods). يُستخدم عندما تكون الكلاسات المشتقة تتشارك في علاقة وراثة حقيقية ("Is-A") وبها كود مشترك
            //Interface : لا يمكن أن يحتوي على متغيرات (Fields) أو دوال مكتوبة بالتفصيل (Concrete methods)، بل يحتوي فقط على توقيعات الدوال (Method Signatures). يُستخدم عندما تكون الكلاسات المشتقة تتشارك في علاقة سلوك مشترك ("Can-Do") دون الحاجة إلى وراثة حقيقية

            //نختار الـ Interface عندما نريد إضافة ميزات وسلوكيات مشتركة لكلاسات مختلفة تماماً وليس بينها وراثة، أو عندما
            //نحتاج لتطبيق الـ Multiple Inheritance (أن يرث الكلاس أكثر من عقد واحد) لأن C# لا تدعم الوراثة المتعددة من الكلاسات

            //لا، لا يمكن للكلاس أن يرث إلا من كلاس مجرد واحد فقط (Single Inheritance)
            //نعم، يمكن للكلاس أن يطبق (Implement) أكثر من Interface بنفس الوقت دون أي مشكلة
            #endregion
        }
    }
}
